/**
 * Created by pekko1215 on 2017/07/15.
 */


const dummnyLines = {
    "中段": [
        [0, 0, 0],
        [1, 1, 1],
        [0, 0, 0]
    ],
    "上段": [
        [1, 1, 1],
        [0, 0, 0],
        [0, 0, 0]
    ],
    "下段": [
        [0, 0, 0],
        [0, 0, 0],
        [1, 1, 1]
    ],
    "右下がり": [
        [1, 0, 0],
        [0, 1, 0],
        [0, 0, 1]
    ],
    "右上がり": [
        [0, 0, 1],
        [0, 1, 0],
        [1, 0, 0]
    ],
    "なし": [
        [0, 0, 0],
        [0, 0, 0],
        [0, 0, 0]
    ]
}

const YakuData = [{
        name: "リプレイ",
        pay: [
            [0, 0, 0],
            [3, 0, 0],
            [0, 0, 15]
        ],
        // flashLine: dummnyLines['中段']
        // 有効にするとフラッシュラインを偽装できる(1ライン機用かな)
    }, {
        name: "ベル",
        pay: [
            [9, 9, 9],
            [12, 0, 0]
        ]
    }, {
        name: "スイカ",
        pay: [
            [12, 0, 0],
            [12]
        ]
    }, {
        name: "チェリー",
        pay: [
            [2, 0, 0]
        ],
    },
    {
        name: "BIG1",
        pay: [
            [15, 0, 0]
        ]
    },
    {
        name: "BIG2",
        pay: [
            [15, 0, 0]
        ]
    },
    {
        name: "BIG3",
        pay: [
            [15, 0, 0]
        ]
    },
    {
        name: "REG",
        pay: [
            [3, 0, 0]
        ]
    },
    {
        name: 'JACGAME',
        pay: [
            [],
            [],
            [0, 0, 15]
        ]
    },
]